#include <stdio.h>
int main()
{
    //ใส่วันที่ วัน เดือน ปี ให้แสดงค่าวันต่อมา
    //1 1 2020
    //2 1 2020
    int d, m, y;
    printf("Enter Date: ");
    scanf("%d %d %d", &d, &m, &y);
    int day;
    if (m == 1 || m == 3 || m == 5 || m == 7 || m == 8 || m == 10 || m == 12)//Kom
    {
        day = 31;
    }
    else if (m == 4 || m == 6 || m == 9 || m == 11)//Yon
    {
        day = 30;
    }
    else if (m == 2)//checkLeapyear
    {
        if (y % 400 == 0 || (y % 4 == 0 && y % 100 != 0))
        {
            day = 29;
        }
        else
        {
            day = 28;
        }
    }
    if (d == day)
    {
        if (m == 12)
        {
            printf("1 1 %d", y + 1);
        }
        else
        {
            printf("1 %d %d", m + 1, y);
        }
    }
    else
    {
        printf("%d %d %d", d + 1, m, y);
    }

    return 0;
}

//คม m=1 3 5 7 8 10 12 มี31
//ยน m=4 6 9 11 มี 30
//พัน m=2
// y mod400=0 or (y mod4=0and y mod100!=0)
/*
คม มี 31 วัน ต้องบอกว่ามีเดือนอะไรบ้าง
ถ้าเป็นคม ใส่ วันที่ 31 ต้อง เปลี่ยนเป็น 1
ถ้าเป็นยน ใส่ วันที่ 30 ต้อง เปลี่ยนเป็น 1
นอกเหนือจากนั้น +1
ถ้า กุมภา 29 เปลี่ยนเป็น 1
        28 เปลี่ยน    1
นอกเหนือจากนั้น +1
*/